{
  "Home": "Home",
  "About Me": "About Me",
  "Projects": "Projects",
  "Contact": "Contact",
  "Software Engineer": "Software Engineer",
  "Front End Developer": "Front End Developer",
  "ENGINEERING": "ENGINEERING",
  "EXPERIENCES": "EXPERIENCES",
  "As a Bachelor of": "As a Bachelor of",
  "Software Engineering": "Software Engineering",
  "desc1": "student at the University of Palestine, I go beyond mere coding to  engineer web systems. I specialize in transforming complex designs into  high-performance, live interfaces with a rigorous focus on scalability  and UX standards.",
  "Download CV": "Download CV",
  "Yaser Ali Shagfa": "Yaser Ali Shagfa",
  "From Gaza :": "From Gaza :",
  "Means War Engineer": "Means War Engineer",
  "Technical": "Technical",
  "Arsenal": "Arsenal",
  "base": "Base",
  "tools": "Tools",
  "advanced": "Advanced",
  "desc2": "While these are my primary tools, I am proficient in many others select the right tool for the specific needs of each project.",
  "A Step into the Unknown": "A Step into the Unknown",
  "desc3": "This year marked the official start of my bachelor’s degree. I entered a world I knew very little about; at the time, I didn't truly understand what 'programming' was or what this path held for me. Although anxiety was the dominant emotion during that period, it ultimately became my primary driver to explore this new field and take my first steps into the world of technology.",
  "Synergy and Resilience": "Synergy and Resilience",
  "desc4": "In 2023, I partnered with a like-minded colleague to master Java (OOP, GUI, JavaFX) and SQL/SQLite. We began developing a custom e-commerce platform for Gaza, a project fueled by rapid innovation. However, our progress was forced to a halt in October due to the war, turning a year of technical growth into a testament of resilience.",
  "Displacement, Adaptation, and Resilience": "Displacement, Adaptation, and Resilience",
  "desc5": "A year of 'educational survival.' Amidst displacement from Rafah, I assisted at my father's pharmacy while pivoting to Web Development (HTML/CSS). Despite the lack of electricity and internet, I resumed my university studies online in June, turning a period of immense personal struggle into a persistent pursuit of knowledge.",
  "Mastery Under Fire": "Mastery Under Fire",
  "desc6": "A year of profound transformation. Despite displacement and living in a tent, I mastered React, Next.js, and TypeScript, delving into RTK, Memoization, and API integration. Using AI and Docs, I built a Pharmacy Inventory System and a large-scale consolidated project. Despite the war’s impact on my GPA, I am resiliently finishing my final 46 credit hours, ready to bring my expertise to the global market.",
  "The Launchpad – Reaching the World": "The Launchpad – Reaching the World",
  "desc7": "Focused on bridging the gap between my projects and the global market by finalizing my portfolio. If you are reading this, my resilience has reached its destination. My 2026 roadmap includes mastering Docker and Backend development to evolve into a versatile Full-Stack Developer. My goal is to transition from a survivor of circumstances to a leader in technology.",
  "Restaurant System": "Restaurant System",
  "Full-Stack Solution / Admin Dashboard": "Full-Stack Solution / Admin Dashboard",
  "High-performance": "High-performance",
  "React": "React",
  "desc8": "app with scalable architecture (SOLID). Features seamless customer UX and a robust management system.",
  "Localization (i18n): 5,000+ entries.": "Localization (i18n): 5,000+ entries.",
  "Admin: Real-time analytics & inventory.": "Admin: Real-time analytics & inventory.",
  "Optimized: Fast loads via": "Optimized: Fast loads via ",
  "Lazy/Memoization.": " Lazy/Memoization.",
  "Live Demo": "Live Demo",
  "Source Code": "Source Code",
  "Contact With Me": "Contact With Me",
  "Your Name": "Your Name",
  "Your Mail": "Your Mail",
  "Your Message": "Your Message",
  "submit": "submit",
  "SEND MESSAGE": "SEND MESSAGE",
  "OR": "OR",
  "Reach out directly via": "Reach out directly via",
  "Let's Build Together": "Let's Build Together",
  "Every great system starts with a conversation. Whether you have a": "Every great system starts with a conversation. Whether you have a",
  "clear vision": "clear vision",
  "or just a": "or just a",
  "rough idea": "rough idea",
  "desc9": ", I’m here to engineer the solution.",
  "Why me?": "Why me?",
  "desc10": "Scalable Architecture • High Performance • Clean Code • OngoingTechnical Support.",
  "Consultation is always free. Let’s talk!": "Consultation is always free. Let’s talk!"
}
